(function(){
	let arr = [
		["合肥市", "毫州市", "芜湖市", "马鞍山市", "池州市", "黄山市", "滁州市", "安庆市", "淮南市", "淮北市", "蚌埠市", "巢湖市", "宿州市", "宣城市", "六安市", "阜阳市", "铜陵市明光市", "天长市", "宁国市", "界首市", "桐城市"],
		["福州市", "厦门市", "泉州市", "漳州市", "南平市", "三明市", "龙岩市", "莆田市", "宁德市建瓯市", "武夷山市", "长乐市", "福清市", "晋江市", "南安市", "福安市", "龙海市邵武市", "石狮市", "福鼎市", "建阳市", "漳平市", "永安市"],
		["兰州市", "白银市", "武威市", "金昌市", "平凉市", "张掖市", "嘉峪关市", "酒泉市", "庆阳市定西市", "陇南市", "天水市", "玉门市", "临夏市", "合作市", "敦煌市", "甘南州"],
		["贵阳市", "安顺市", "遵义市", "六盘水市", "兴义市", "都匀市", "凯里市", "毕节市", "清镇市", "铜仁市", "赤水市", "仁怀市福泉市"],
		["石家庄市", "保定市", "唐山市", "邯郸市邢台市", "沧州市", "衡水市", "廊坊市", "承德市", "迁安市", "鹿泉市", "秦皇岛市", "南宫市", "任丘市", "叶城市", "辛集市", "涿州市", "定州市", "晋州市", "霸州市", "黄骅市", "遵化市", "张家口市", "沙河市", "三河市", "冀州市", "武安市", "河间市深州市", "新乐市", "泊头市", "安国市", "双滦区", "高碑店市"]
	],i, j = arr.length, brr = [];

	for(i=0;i<j;i++){
		arr[i].forEach(function(e,i){
			brr.push({
				descript: e,
				code: 'city-' + i
			});
		}) 
		
	}

	// brr = JSON.stringify(brr);

	exports = module.exports = {
	  "message": "以获取到数据!",
	  "success": true,
	  "list": brr
	}
}())


